# SQL Master Data Science
SQL lessons from the Master reviewed and explained in detail.

In [44]:
#To load ipython-sql, use the following magic command:
%load_ext sql
# Next, we will only need the create_engine() function from sqlalchemy so let’s import that with the following line:
from sqlalchemy import create_engine
#Connect to my PostgreSQL Database
%sql postgresql://juanfatri:@localhost/mydatabasename
#psql mydatabasename

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [35]:
#Tried special characters but found some problems. Will solve that later, for now it is not essential.
#from pgspecial.main import PGSpecial
#from pgspecial.namedqueries import NamedQueries
#%%sql
#\! pwd 
#special characters not installed... I need to install $ pip install pgspecial

## 1-Create and Delete Databases

In [51]:
#%%sql
#CREATE DATABASE networking;
#If I tried this I get and error, Databases cannot be created inside a transaction block.

## 2-Create and Delete Tables

In [52]:
%%sql
CREATE TABLE friends1 (nombre VARCHAR,
                      edad INT,
                      email VARCHAR);

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [53]:
%%sql
DROP TABLE friends1;

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [55]:
%%sql
CREATE TABLE friends1 (nombre VARCHAR,
                      edad INT,
                      email VARCHAR);

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

## 3-Populate Tables

In [58]:
%%sql
INSERT INTO friends1 VALUES ('Linoel Messi', 30, 'messi@barca.com');

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[]

In [68]:
%%sql
INSERT INTO friends1 VALUES ('Ronaldo', 34, 'r@juve.com'),('Luka',32,'l@madrid.com'),('Mario',25,'notiene'), ('Marina',24,'marina@asdf.com') , ('Renata',1, 'notiene');

 * postgresql://juanfatri:***@localhost/mydatabasename
5 rows affected.

[]

In [72]:
%%sql
INSERT INTO friends1 VALUES ('Donald Tramp', 71, 'trump@twitter.com');

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[]

In [73]:
%%sql
INSERT INTO friends1 VALUES ('Ivanka Tramp', 35);

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[]

## 4-Extracting Information

In [74]:
%%sql
SELECT * FROM friends1;

 * postgresql://juanfatri:***@localhost/mydatabasename
10 rows affected.

[('Linoel Messi', 30, 'messi@barca.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Mario', 25, 'notiene'),
 ('Marina', 24, 'marina@asdf.com'),
 ('Renata', 1, 'notiene'),
 ('Donald Tramp', 71, 'trump@twitter.com'),
 ('Ivanka Tramp', 35, None)]

In [76]:
%%sql
SELECT nombre, edad FROM friends1

 * postgresql://juanfatri:***@localhost/mydatabasename
10 rows affected.

[('Linoel Messi', 30),
 ('Ronaldo', 34),
 ('Luka', 32),
 ('Ronaldo', 34),
 ('Luka', 32),
 ('Mario', 25),
 ('Marina', 24),
 ('Renata', 1),
 ('Donald Tramp', 71),
 ('Ivanka Tramp', 35)]

## 5-Filtering Information

In [77]:
%%sql
SELECT * FROM friends1 WHERE edad < 25;

 * postgresql://juanfatri:***@localhost/mydatabasename
2 rows affected.

[('Marina', 24, 'marina@asdf.com'), ('Renata', 1, 'notiene')]

In [78]:
%%sql
SELECT nombre, edad FROM friends1 WHERE edad <> 24;
#can also be written: SELECT nombre, edad FROM friends1 WHERE edad != 24;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Linoel Messi', 30),
 ('Ronaldo', 34),
 ('Luka', 32),
 ('Ronaldo', 34),
 ('Luka', 32),
 ('Mario', 25),
 ('Renata', 1),
 ('Donald Tramp', 71),
 ('Ivanka Tramp', 35)]

In [82]:
%%sql
SELECT * FROM friends1 WHERE nombre LIKE '%L%';

 * postgresql://juanfatri:***@localhost/mydatabasename
3 rows affected.

[('Linoel Messi', 30, 'messi@barca.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Luka', 32, 'l@madrid.com')]

In [84]:
%%sql
SELECT * FROM friends1 WHERE UPPER(nombre) LIKE '%L%';

 * postgresql://juanfatri:***@localhost/mydatabasename
6 rows affected.

[('Linoel Messi', 30, 'messi@barca.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Donald Tramp', 71, 'trump@twitter.com')]

In [85]:
%%sql
SELECT * FROM friends1 WHERE UPPER(nombre) NOT LIKE '%L%';

 * postgresql://juanfatri:***@localhost/mydatabasename
4 rows affected.

[('Mario', 25, 'notiene'),
 ('Marina', 24, 'marina@asdf.com'),
 ('Renata', 1, 'notiene'),
 ('Ivanka Tramp', 35, None)]

In [86]:
%%sql
SELECT * FROM friends1 WHERE email IS NULL;

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[('Ivanka Tramp', 35, None)]

## 6-Delete information
There are two main options Delete and Drop:(i) Drop eliminates the table completely. (ii)Delete eliminates row selectively

In [90]:
%%sql
DELETE FROM friends1 WHERE edad<18;

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[]

## Exercise 1
•Generate'Facebook' table where every person is identified with the name, age, city of residence, and email. The table should have at leas 5 rows.

•Write a query to obtain Facebook friends which are younger than<18 or older than 65 years.

•Write a query to obtain all facebook friends which do not reside in Madrid.

In [92]:
%%sql
CREATE TABLE facebook2 (name VARCHAR,
                       age INT,
                       residence VARCHAR,
                       email VARCHAR);

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [93]:
%%sql
INSERT INTO facebook2 VALUES ('Ronaldo', 34, 'Tomares', 'r@juve.com'),('Luka',32, 'Valencia', 'l@madrid.com'),
('Mario',25,'Madrid', 'notiene'), ('Marina',24, 'Getafe', 'marina@asdf.com') , ('Renata',1,'Madrid', 'ren@reina.com'),
('Isabel',75, 'Trebujena', 'Isa@asdf.com') , ('Antonio',6,'Madrid', 'Tony@porcasa.com'),('Lisardo',91, 'Oviedo', 'LIsa@asdf.com') ,
('Antonia',56,'Madrid', 'Tonya@porcasa.com');

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[]

In [95]:
%%sql
SELECT * FROM facebook2 WHERE age<18 or age>65;

 * postgresql://juanfatri:***@localhost/mydatabasename
4 rows affected.

[('Renata', 1, 'Madrid', 'ren@reina.com'),
 ('Isabel', 75, 'Trebujena', 'Isa@asdf.com'),
 ('Antonio', 6, 'Madrid', 'Tony@porcasa.com'),
 ('Lisardo', 91, 'Oviedo', 'LIsa@asdf.com')]

In [96]:
%%sql
SELECT * FROM facebook2 WHERE residence !='Madrid';

 * postgresql://juanfatri:***@localhost/mydatabasename
5 rows affected.

[('Ronaldo', 34, 'Tomares', 'r@juve.com'),
 ('Luka', 32, 'Valencia', 'l@madrid.com'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com'),
 ('Isabel', 75, 'Trebujena', 'Isa@asdf.com'),
 ('Lisardo', 91, 'Oviedo', 'LIsa@asdf.com')]